[
	"I have to attend mandatory jury duty for a civil case involving a stolen collection of antique garden gnomes. They said the trial could last weeks.",
	"My passport expired because I accidentally mailed it to a radio station for a 'Cutest Passport Photo' contest and they never sent it back.",
	"My cat developed separation anxiety so severe that my vet recommended I not leave her side for more than three hours at a time.",
	"I recently had minor toe surgery and the doctor said absolutely no sand, or risk 'catastrophic toe compromise.' His words, not mine.",
	"I'm currently embroiled in a very complicated Airbnb lawsuit where I’m legally prohibited from leaving the state until the deposition.",
	"I started a pottery class for stress management, and my final exam piece exploded in the kiln. I'm now on probation with the art center and must redo it immediately or be banned for life.",
	"I slipped in a Whole Foods and got a free year of groceries... but only if I stay within 50 miles of their flagship store. It's an insane deal.",
	"I forgot I volunteered to coach a children's soccer team and our regional championship falls on the exact same weekend. The kids have T-shirts that say 'Coach or Die' — no pressure.",
	"I joined a pilot program for a self-driving bicycle company and I'm contractually obligated to be 'on-call' as a human override until the beta ends.",
	"I entered a chili cook-off at my local community center as a joke — and accidentally qualified for Nationals. It's in Nebraska. Same weekend.",
	"I am already booked for a regional beekeeping conference where I'm judging the 'Friendliest Hive' contest.",
	"My great-uncle's parrot passed away and I'm giving the eulogy at the bird's memorial service that weekend.",
	"My dermatologist said I have a rare condition where tropical sun exposure could trigger spontaneous hives shaped like celebrity faces.",
	"My neighbor’s son challenged me to a fencing match and now it’s an officially sanctioned duel, legally binding me to stay until it's over. If I leave early he gets all my stuff.",
	"I won a lifetime worth of free pizza but I have to pick it up in person every week or I forfeit the prize.",
	"I enrolled in an intensive yodeling course and now I'm performing at a regional festival the same weekend.",
	"My friend's python went missing and I'm part of the official search party until further notice.",
	"I got cast as a background extra in a historical reenactment of the invention of the wheel and shooting is that weekend.",
	"I’m participating in a beta test for personalized tornado shelters and can’t leave the test area for liability reasons.",
	"I'm in charge of costume adjustments for my cousin’s guinea pig at a pet fashion show.",
	"I signed up for a mindfulness retreat that prohibits travel within 500 miles during the final week.",
	"The HOA is doing a surprise inspection of my backyard gnome collection, and I have to be there to defend it.",
	"My chiropractor advised against flying after I sneezed and allegedly shifted three vertebrae into chaos mode.",
	"I finally qualified for the finals of an underground chess-boxing league and the match is that same weekend.",
	"My passport is being held hostage due to a very complicated overdue library fine dispute.",
	"I volunteered to babysit an endangered turtle nest and the hatching window just shifted unexpectedly.",
	"I'm scheduled to speak at a niche conference for people who collect misprinted coins.",
	"My best friend's therapy llama had a mental health relapse and I’m the designated support human.",
	"I entered a local bake-off as a joke and somehow made it to the national semifinals.",
	"My apartment is being fumigated for an infestation of emotionally unstable moths and I have to supervise the evacuation.",
	"I slipped in a Whole Foods and got free groceries for a year, but only if I check in every Saturday.",
	"I joined a community theatre production of ‘Fast and Furious: The Musical’ and opening night is the same weekend.",
	"My dog is competing in a regional talent show and I’m his emotional coach.",
	"I found out I’m a finalist for a 'Most Average Citizen' award and the ceremony conflicts with the wedding.",
	"I accidentally won a free makeover contest that requires a three-day in-person spa quarantine.",
	"I promised to help my neighbor harvest his artisanal honey collection and he’s emotionally fragile about it.",
	"The DMV randomly recalled my driver’s license and I have to retake the driving exam immediately.",
	"My subscription-based scooter rental service has a glitch and now I’m technically liable for 45 scooters until I resolve it in person.",
	"I'm attending a 72-hour silent disco retreat and early departure would break the 'sacred rhythm'.",
	"My cat developed attachment issues and the vet prescribed me to stay within 100 yards of him for the next month.",
	"I committed to being a human chess piece in a charity event and I'm the queen so I can't just bail.",
	"My favorite food truck is hosting a once-in-a-lifetime secret menu event that weekend and I already RSVP’d.",
	"I accidentally got accepted into a regional duck-calling competition and now I’m expected to represent my district.",
	"I finally got an appointment with a famous reiki healer who books five years out and the date is immovable.",
	"My nephew invented a new sport and the launch tournament is that weekend. I’m refereeing and everything.",
	"I’m contractually obligated to participate in a focus group for a new line of luxury camping socks.",
	"I volunteered to officiate a wedding between two iguanas at my local petting zoo.",
	"My apartment's Wi-Fi router unionized and I’ve been summoned to the mediation talks.",
	"I entered a competitive jigsaw puzzle league and nationals are scheduled that weekend.",
	"My brother signed me up to be a living mannequin at a regional department store competition.",
	"I agreed to housesit a mansion that has 13 exotic birds with strict emotional support needs.",
	"I am currently the reigning neighborhood chili champion and have to defend my title at the cook-off.",
	"My dentist said my wisdom teeth are 'holding rage' and must be extracted immediately or risk an emotional meltdown.",
	"I entered a speed-lawn-mowing contest and now I’m seeded number two in my division.",
	"I'm attending the grand reopening of the world’s largest ball of twine, and it’s a family tradition.",
	"My neighbor’s kid insisted I cosplay as a wizard for his birthday party and the costume fittings are the same weekend.",
	"I promised to coach a local turtle race and the finals got moved to the wedding date.",
	"I accidentally triggered a 'no-travel' clause in a joke insurance policy I bought and now I’m legally stuck within my city limits.",
	"My tarot reader said if I cross water this month I will lose all my left shoes forever.",
	"My kombucha brewing club is having its annual fermentation festival and I’m a keynote speaker.",
	"I committed to an elite axe-throwing league and our semifinals got rescheduled to that weekend.",
	"I agreed to mentor a group of at-risk bonsai trees and they require daily affirmation sessions.",
	"My chiropractor warned me that flying could misalign my 'happiness vertebra' and plunge me into existential despair.",
	"I finally scored a spot in a highly competitive sourdough bread retreat and forfeiting would blacklist me from future events.",
	"I'm taking part in a synchronized drone piloting showcase and I'm the designated emergency flyer.",
	"My HOA threatened fines if I don't personally supervise the trimming of my topiary dragon.",
	"A rare fungus outbreak hit my favorite local cheese shop and I volunteered to assist the emergency containment team.",
	"I discovered a hidden passageway under my apartment and local historians have asked me to stay for documentation.",
	"I'm competing in a 'slowest marathon' charity event where stopping before 48 hours disqualifies you.",
	"I got recruited into a surprise town parade celebrating the invention of the paperclip.",
	"My hamster entered hibernation early and I need to monitor his dreams according to the vet.",
	"I'm a backup tambourine player for a local ska band and they have an emergency gig that weekend.",
	"The regional alpaca association named me 'honorary herder' and the initiation rites conflict with the wedding.",
	"I’m legally obligated to participate in a paintball recreation of the Boston Tea Party for a historical festival.",
	"My friend's startup is launching biodegradable phone cases and I'm legally listed as a 'launch ambassador.'",
	"I joined a medieval falconry guild and my falcon can't travel without my emotional support.",
	"I lost a bet and now have to MC a hamster fashion show the same weekend.",
	"I'm attending a prestigious underground soup competition where I’m a finalist in the 'Most Mysterious Broth' category.",
	"The mayor is awarding me 'Most Improved Resident' at the town’s annual civic gala.",
	"My mailman challenged me to a double-or-nothing ping pong match and legally I must defend my title.",
	"My city finally approved my permit for competitive sidewalk chalk murals and the event is mandatory.",
	"I accidentally enrolled in a two-week cheese-rolling endurance camp and it overlaps with the wedding.",
	"I was nominated for a fake Nobel Prize in Snack Innovation and the 'ceremony' conflicts with the trip.",
	"I found out my doppelgänger is running for local office and I have to stay to avoid confusing the electorate.",
	"I'm taking part in a government beta test for 'Emotionally Responsive Stop Signs' and can't leave the trial area.",
	"I’m on probation with my fantasy football league and required to attend mandatory conflict mediation training.",
	"My city is hosting a 'World's Longest Conga Line' attempt and they need all residents to participate.",
	"I’m judging a regional ‘Best Inflatable Holiday Display’ contest and it happens that weekend.",
	"My slow cooker malfunctioned and now I have to manually supervise a 72-hour stew project or void the warranty.",
	"I'm attending a workshop titled 'Negotiating with Geese' because my neighborhood flock has gotten aggressive.",
	"My gaming guild is holding its first in-person summit and they’re expecting me to deliver the opening speech.",
	"My neighbor’s award-winning pumpkin patch was vandalized and I’ve been deputized into the recovery squad.",
	"My home brewing project got accepted into a last-minute local kombucha competition and it’s non-refundable.",
	"The city transit department needs volunteers to act as 'Lost Tourists' for an emergency drill and I signed up months ago.",
	"I'm contractually obligated to attend my barista's improv show after losing a loyalty card bet.",
	"I found out I’m a finalist in a nationwide bad poetry competition and must read my work in person.",
	"My workplace accidentally entered me into a 'Who Can Drink the Most Coffee Without Dying' contest.",
	"I'm competing in a community boat race but the boat is made entirely of recycled pizza boxes.",
	"My therapist insists that I conquer my fear of mall Santas by attending a desensitization weekend retreat.",
	"The local news team invited me to play the role of 'Weather Person's Enthusiastic Friend' during the forecast.",
	"My cousin started a soapbox derby team and I’m their driver for the championship heat.",
	"I adopted a snail and it’s legally classified as an 'emotional mobility pet' so I can’t travel yet.",
	"I’m volunteering for a charity event where I have to impersonate famous statues and remain motionless for 6 hours.",
	"The plumbing in my apartment building is getting judged for a 'Best Pipes in the City' award and I must attend the inspection.",
	"I got my tongue pierced for a dare and my speech therapist scheduled mandatory practice that weekend.",
	"I'm competing in the semifinals of a local 'Who Can Yell at Soup the Loudest' contest.",
	"The zoo made me an honorary penguin godparent and the first family gathering is happening that weekend.",
	"I accidentally became president of my neighborhood mushroom enthusiast society and our AGM can't be rescheduled.",
	"My DNA was accidentally entered into a national hot sauce tolerance study and the final round is in town that weekend.",
	"I’m attending my uncle’s annual competitive bird-calling weekend in rural Vermont.",
	"I’m leading a guided meditation for nervous goats at a therapeutic farm retreat.",
	"I’m attending a two-day masterclass in advanced whistling techniques.",
	"I'm obligated to host the annual neighborhood inflatable pool summit at my house.",
	"I’m starring in a community theater production of ‘Shrek: The Horror Musical.’",
	"I’m hosting a regional symposium on the ethical treatment of imaginary friends.",
	"I’m competing in the local marshmallow architecture tournament.",
	"I’m attending a professional conference for competitive jigsaw puzzlers.",
	"I have to judge the county fair’s ‘Most Disappointing Pie’ competition.",
	"I'm booked for a rare cactus appreciation society's secret garden tour.",
	"I’m participating in my grandmother’s competitive knitting team meet-up.",
	"I'm attending a cheese sculpting masterclass led by a semi-famous artisan.",
	"I'm presenting at the first-ever International Conference on Advanced Pancake Flipping.",
	"I’m attending my friend's live-action roleplay of ‘Survivor: Suburban Edition.’",
	"I'm competing in the state finals for interpretive sandwich making.",
	"I promised to be the official drum major for my neighbor’s backyard parade.",
	"I'm performing in a flash-mob tribute to the inventor of the post-it note.",
	"I’m helping organize a surprise birthday party for my friend’s pet tarantula.",
	"I'm officiating a vow renewal ceremony for a couple who met at a Waffle House.",
	"I'm participating in a scavenger hunt across six counties for charity.",
	"I'm scheduled to unveil my art project: a life-sized portrait of my cousin made entirely of cereal.",
	"I'm attending a three-day silent retreat themed around communicating only through kazoo.",
	"I’m on a waitlist for a mystical drum circle retreat and just got called up.",
	"I’m attending the annual ‘Competitive Scrapbooking for Charity’ event.",
	"I'm hosting a one-day festival celebrating the cultural significance of socks.",
	"I'm representing my family at the Great Midwestern Rubber Band Ball Roll-off.",
	"I’m required to be present at my dog’s obedience school graduation ceremony.",
	"I'm competing in the city’s 'Longest Unbroken Ice Cream Cone Balance' tournament.",
	"I'm chairing a conference on the future of novelty license plates.",
	"I'm attending a pottery slam where competitors make clay busts while blindfolded.",
	"I’m hosting a ‘How to Walk Like a Duck’ workshop for beginner bird watchers.",
	"I'm attending a record-breaking simultaneous hula hoop event.",
	"I'm giving a TED-style talk at my local library titled ‘The Hidden Language of Houseplants.’",
	"I'm the designated referee for my niece's highly anticipated sibling water balloon duel.",
	"I'm taking my emotional support ferret to his certification renewal exam.",
	"I'm acting as the human chessboard in a large-scale Renaissance Fair reenactment.",
	"I’m hosting a documentary screening about the underground world of extreme ironing.",
	"I'm a judge in the 'Best Homemade Cat Tower' regional finals.",
	"I'm headlining a competitive kazoo improvisation battle.",
	"I'm competing in a one-mile backward running race for charity.",
	"I'm in charge of security at a llama agility showcase.",
	"I'm scheduled to take part in a mock pirate trial and sentencing at the local maritime museum.",
	"I'm playing the role of 'angry bystander' in a historically accurate bank heist reenactment.",
	"I'm attending the annual celebration of the first left-handed spatula invention.",
	"I'm joining a flash hike organized by the Society for the Preservation of Obsolete Hiking Gear.",
	"I'm presenting my homemade jam collection at the regional 'Preserves and Pickles' fair.",
	"I'm participating in a 24-hour competitive macrame challenge.",
	"I'm performing at my local karaoke league’s semi-annual power ballad playoffs.",
	"I'm acting as a spotter at my cousin’s DIY soapbox car rally championship.",
	"I'm performing a dramatic reading of outdated Yelp reviews at a local theater night.",
	"I'm attending a three-day intensive on advanced hula hoop meditation techniques.",
	"I'm leading a parade of trained ducks through downtown for a civic pride initiative.",
	"I'm competing in the National Competitive Napping Trials and must stay local for monitoring.",
	"I'm hosting a live tutorial on how to fold fitted sheets without losing your will to live.",
	"I'm attending a weekend-long camp focused on achieving emotional balance through pancake art.",
	"I'm presenting my theory on the economic impact of sock gnomes at a niche economics symposium.",
	"I'm hosting a glow-in-the-dark frisbee marathon to raise awareness for reversible jackets.",
	"I'm participating in a trial program for self-aware pothole detection technology.",
	"I'm attending my mentor's retirement party from a competitive extreme ironing league.",
	"I'm officiating a friendship bracelet renewal ceremony for two aging golden retrievers.",
	"I'm representing my local chapter at the International Bean Counting Championships.",
	"I'm performing in an outdoor interpretive dance piece titled 'The Life and Death of a Shopping Cart.'",
	"I'm giving a motivational talk at a regional gathering of semi-professional yo-yo performers.",
	"I'm participating in a cake-decorating battle that includes surprise sabotage rounds.",
	"I'm attending a conference for future-themed Renaissance fairs where we LARP as people from 3024.",
	"I'm judging a speed-tofu sculpting competition at the downtown food festival.",
	"I'm hosting a citywide scavenger hunt where the prize is a lifetime supply of novelty umbrellas.",
	"I'm the backup cowbell player for a competitive middle school percussion ensemble.",
	"I'm attending a spiritual retreat where the main activity is synchronized underwater tea ceremonies.",
	"I'm playing a non-speaking role in a silent opera about the invention of spoons.",
	"I'm running a charity event where participants have to dress as inanimate objects and give motivational speeches.",
	"I'm attending a two-day laughter yoga summit with a no-phone policy.",
	"I'm participating in an inter-neighborhood bake-off where sabotage is not only allowed but encouraged.",
	"I'm acting as a human statue in my cousin's avant-garde art installation titled 'Capitalism on Pause.'",
	"I'm competing in a national whittling competition for creating historical figures out of pool noodles.",
	"I'm attending an invite-only conference on emerging trends in reversible outerwear.",
	"I'm playing the role of 'grumpy town crier' at an offbeat local renaissance festival.",
	"I'm part of a field team documenting the migratory habits of rogue shopping carts.",
	"I'm performing in a midnight shadow puppet adaptation of 'The Fast and the Furious' franchise.",
	"I'm competing in the semifinals of the 'Most Enthusiastic Pie Eating While Reading Poetry' competition.",
	"I'm attending a mindfulness seminar themed around channeling your inner ferret.",
	"I'm coaching a dodgeball team made up entirely of amateur magicians and the regional finals are that weekend.",
	"I'm presenting my project 'Uncomfortable Chairs Through History' at a design museum pop-up.",
	"I'm judging a contest where people compete to invent the world's worst board game.",
	"I'm volunteering as a 'laugh leader' for a charity event that raises awareness for joke appreciation.",
	"I'm taking part in a 48-hour endurance rock-paper-scissors tournament for charity.",
	"I'm attending a ceremonial groundbreaking for my town’s first hedge maze specifically for introverts.",
	"I'm narrating a dramatic live reading of a city's parking violations from 1987.",
	"I'm leading a workshop on how to effectively shout compliments at strangers from across a park.",
	"I'm attending a long-awaited seminar on postmodern culinary disasters.",
	"I'm facilitating a pancake flipping contest where all participants wear roller skates.",
	"I'm participating in a choral ensemble that only sings parody versions of national anthems.",
	"I'm the guest of honor at the regional gala for Competitive Decorative Napkin Folding.",
	"I'm acting in a flash mob that reenacts famous scenes from 90s soap operas entirely underwater.",
	"I'm mentoring a youth team preparing for the International Egg Balancing Open.",
	"I'm hosting a neighborhood-wide extreme hopscotch tournament with sanctioned referees.",
	"I'm attending a screening of badly dubbed infomercials with live dramatic reenactments.",
	"I'm scheduled to be the surprise 'mystery judge' for a local food truck showdown."
]
